{"modelTopology": {"keras_version": "2.0.8-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 63, 64, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "GlobalAveragePooling2D", "config": {"dtype": "float32", "trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "global_average_pooling2d_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 4, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_1"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["dense_2", 0, 0, {}]]], "name": "multiply_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "inbound_nodes": [[["multiply_1", 0, 0, {}], ["conv2d_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Dropout", "config": {"dtype": "float32", "rate": 0.25, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "GlobalAveragePooling2D", "config": {"dtype": "float32", "trainable": true, "name": "global_average_pooling2d_2", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "global_average_pooling2d_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 16, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["global_average_pooling2d_2", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "multiply_2"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["dense_4", 0, 0, {}]]], "name": "multiply_2"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "inbound_nodes": [[["multiply_2", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "name": "add_2"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Dropout", "config": {"dtype": "float32", "rate": 0.25, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "GlobalAveragePooling2D", "config": {"dtype": "float32", "trainable": true, "name": "global_average_pooling2d_3", "data_format": "channels_last"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "global_average_pooling2d_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["global_average_pooling2d_3", 0, 0, {}]]], "name": "dense_5"}, {"class_name": "Dropout", "config": {"dtype": "float32", "rate": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 3036, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_6"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_6", 0, 0]], "name": "model_1"}}, "training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "conv2d_1/kernel", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [64, 4], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [4, 64], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [256, 16], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [16, 256], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [256, 3036], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [3036], "dtype": "float32"}]}]}
